import CurrentData from "./CurrentData";
import AvatarPhoto from "./AvatarPhoto";
import { Typography } from "antd";
const { Title, Paragraph, Text, Link } = Typography;

const News = () => {
  return (
    <div>
      <div
        style={{ width: "100%", height: "55px", backgroundColor: "red" }}
      ></div>
      <div style={{ display: "flex" }}>
        <CurrentData />
        <Title
          style={{
            textAlign: "center",
            width: "80%",
            margin: "0 40px",
            marginTop: "10px",
          }}
          level={2}
        >
          Проповедь в Неделю 18-ю по Пятидесятнице,
        </Title>
      </div>
      <Title
        style={{ textAlign: "center", width: "80%", margin: "0 150px" }}
        level={2}
      >
        день памяти святых отцов VII Вселенского Собора
      </Title>
      <div style={{ display: "flex", alignItems: "flex-start", gap: "16px" }}>
        <AvatarPhoto />
        <Paragraph style={{ marginTop: "20px" }}>
          Сегодня, в Неделю 18-ю по Пятидесятнице, день памяти святых отцов VII
          Вселенского Собора, совершили Божественную литургию в храме Казанской
          иконы Божией Матери. «Всечестные отцы, братья и сестры! Всех вас
          сердечно приветствую с днём воскресным, с днем памяти святых отцов VII
          Вселенского Собора. Сегодня мы слышали в проповеди о Евангельском
          отрывке про сеятеля. Апостол Павел, согласно Евангельскому учению,
          говорит, что мы должны сеять, но сеять в соответствии с тем, какие
          всходы ожидаем получить: «… кто сеет скупо, тот скупо и пожнет; а кто
          сеет щедро, тот щедро и пожнет» (2 Кор.9:6). Говорит он, это, конечно,
          не о земном сеянии – не о пшенице, не о просе – а о сеянии духовном, о
          том, что мы должны сеять в жатву будущего века. Наше сеяние – это суть
          дела добродетели, которые включают в себя и мысль, и желание, и слово,
          и действие. Всё это будет взвешено на весах вечности и определена ему
          ценность. <br />
          Каждый из нас желает себе, безусловно, добра, и этот закон природы
          Господь открывает словамизаповеди: «Возлюби ближнего твоего, как
          самого себя» (Мф.22:39). То есть, Он констатирует, что мы себя любим.
          «Ибо никто никогда не имел ненависти к своей плоти, но питает и греет
          ее, как и Господь Церковь» (Еф.5:29) – говорит апостол Павел. Если мы
          хотим для нашей плоти комфорта, вкусной пищи (готовимся к праздникам,
          бывает, не один день, чтобы провести его светло, торжественно, и чтобы
          он вспоминался ещё несколько дней), то, как же нам нужно постараться,
          чтобы в Небесном Царстве нам Господь отвёл достойное место! Ведь
          знаем, что не все праведники получают одинаковую славу от Бога, как и
          небесные светила разнятся в своей славе, в том свете, который они
          получают и отражают от Отца. Если мы по крайней мере не хотим
          разделить с грешниками участь вечных мучений, то подумаем: как жили
          праведники, что наследовали Небесное Царство? Вот один из примеров
          жизни, которой нам нужно подражать – это жизнь святых отцов
          VIIВселенского Собора, память которых мы сегодня вспоминаем. Чем они
          засевали поле своей жизни? В первую очередь, своей благочестивой
          жизнью. Апотом, когда наступили сложные годы и испытания,исповедовали
          свою веру вслух, утверждали почитание икон и всех других священных
          изображений, ибо по учению святых отцов Церкви,слава Первообраза на
          образ восходит. Они сеяли не только словами, они сеяли в буквальном
          смысле своей плотью и своими костями, отдавая тело своё на растерзание
          нечестивым мучителям. Тем самым снова и снова подтверждая, что они
          есть носители Духа Истины. Можем ли мы с вами сегодня представить,
          чтобы молились в храме, который не украшен благолепной церковной
          росписью, без икон –только пустые голые стены? Это унылое зрелище
          можно было представить себе во времена гонений XX века, когда фрески
          сбивали с храмов, иконы сжигали, и порой верным чадам Христовой Церкви
          приходилось молиться в убогих помещениях, в сараях, в подвалах, нося в
          сердце своём образ Христа. Именно благодаря их вере, их благочестию,
          их исповеданию, их сеянию взошли богатые всходы, которыми мы сегодня
          питаемся обильно, благодатно, радостно. Но что мы оставим своим детям,
          внукам, нашим потомкам? Смогут ли они так же, как и мы,получать
          радость духовного общения? Сегодня, как бы исподволь, как бы не
          насильно, но очень уверенно пытается войти в нашу жизнь и уже входит
          некая псевдокультура. В том числе и церковные пытаются выдать за некое
          искусство изуродованный образ Божий и иконы святых, где нет лика, а
          есть обожжённая доска и венец, нимбсвятости. А святости чего? Чёрного
          пятна? Вот это выдают сегодня за нечто такое особенное, чему нужно
          поклоняться, чему нужно рукоплескать и о чем нужно говорить. Некоторые
          неустойчивые ввере люди соблазняются и даже приобретают такие
          псевдоиконы. Это великое горе для нашего народа сегодня, что он не
          может отделить добро от зла, свет от тьмы. Ибо дьявол хитёр, лукав и
          понимает: когда нельзя человека прямо совратить на грех, он ищет как
          обмануть, предлагает подмену настоящего. Мы живём сейчас в этой
          подмене, когда даже жизнь становится виртуальной. В этой жизни – не
          настоящей, а выдуманной жизни – в основном живут наши дети. И взрослые
          часто погружаются в интернет, в свои смартфоны, теряя живую связь не
          только с Богом, но и со своими близкими и родными – с детьми, с
          родителями. Это настоящая беда нашего современного общества. Если мы
          будем иметь перед собой образ Божий,образы святых чад Церкви и чад
          Божиих, если мы будем стараться подражать им, чтобы стать творениями
          совершенными, чтобы не мы жили, тем более не страсти в нас жили, но
          жил в нас Иисус Христос, тогда, конечно, все эти вызовы лукавого мира
          не смогут глубоко коснуться нашего сердца. Мы сможем правильно
          объяснить нашим близким, где опасность и в чем она заключается. Если
          мы будем иметь в своём сердце любовь, если эта любовь будет согрета
          горячей молитвой, то Господь сохранит нас от всякого зла. Будем
          стараться сеять богато в этой жизни добрыми делами, чтобы богато и
          пожать в жизни будущего века. Аминь. С праздником всех вас
          возлюбленные братья и сестры!»
        </Paragraph>
      </div>
    </div>
  );
};

export default News;
